# CannotCopyImportInstancesAcrossProjects Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotCopyImportInstancesAcrossProjects Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Linked Imported Files cannot be copied across projects. All non-RVT linked files will be pasted as imports instead.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCopyImportInstancesAcrossProjects { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCopyImportInstancesAcrossProjects As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCopyImportInstancesAcrossProjects {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace